Revit 2024 API
BuiltInFailures.SiteFailures.SitePhasesDontOverlap Property
 The phases of the two surfaces you are merging do not overlap. You can continue the operation, or cancel it and select a different pair of surfaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SitePhasesDontOverlap { get; }
Visual Basic
Public Shared ReadOnly Property SitePhasesDontOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SitePhasesDontOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace